exampleCases/example.ALMAdvanced.ssc.timeTable/0.original/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $nuSgs0;

boundaryField
{
    lower
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    upper
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    west
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    east
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    north
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    south
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
